# CheckBuildingOperatingSchedule Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..CheckBuildingOperatingSchedule Method
EnergyDataSettings Class See Also
---
Checks that the building operating schedule falls within an appropriate range.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static bool CheckBuildingOperatingSchedule(
	gbXMLBuildingOperatingSchedule buildingOperatingSchedule
)
```

Visual Basic
---
```text
Public Shared Function CheckBuildingOperatingSchedule ( _
	buildingOperatingSchedule As gbXMLBuildingOperatingSchedule _
) As Boolean
```

Visual C++
---
```text
public:
static bool CheckBuildingOperatingSchedule(
	gbXMLBuildingOperatingSchedule buildingOperatingSchedule
)
```

# ### Parameters
buildingOperatingSchedule
    Type: Autodesk.Revit.DB.Analysis..::..gbXMLBuildingOperatingSchedule The building operating schedule to be checked.
# ### Return Value
True if the building operating schedule falls within an appropriate range, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace